package co.jp.chapter01;

public class JavaHomeWork01 {

	static int num;

	public static void main(String[] args) {

		// 質問０１
		// int i = 10;
		// int n = i%5;

		// 答：	n=0
		
		
		

		// 質問２︓ 右の式を解釈してください: a = a > 10 ? 11 : 0;
		/*
			この式は三項演算子を使用しています。
			条件 a > 10 をチェックしています。
				もし'a > 10'の場合、結果は11 になります。
				もし'a ＜10'の場合、結果は0になります。
		
			その後、a に式の結果が代入されます。
			結局、もし'a'が10より大きければ、'a'は11になります。
				  もし'a'が10未満ならば、'a'は0になります。
	          */
		
		
		

		// 質問３︓変数値を⽐較する演算⼦は = or == ?
		
		/*
		 '=='は関係演算子（比較する演算子）です。
		 二つの値が等しいかどうかをチェックします。

		 '='は代入演算子です。
		 値を変数に代入するために使用されます。
		 * 
		 */
		
		
		


		// 質問４︓ブリアン（ boolean ）変数に設定可能の値は「?」「?」。
		/*
			ブリアン（ boolean ）変数に設定可能の値は「true」と「false」です。
		 */

	}

}
